<?php
//.............................................Tasks................................
//..1..Получить линейную запись предложения и вывести рез на экран
/*$res = 1 / (1 + (1 / 2 + (1 / (2 + (3 / 5)))));
echo $res;*/

//..2..Получить линейную запись предложения и вывести рез на экран
/*$a = 5;
$b = 9;
$c = 10;

$res = (-$b + sqrt($b ** 2 - 4 * $a * $c)) / (2 * $a);
echo $res;*/

//..3.. Вычисления значения ф-ции y=7x(2)-3x+6 при любом значении X( (2) - квадрат
/*$x = rand(1, 100);

$y = 7 * ($x ** 2) - 3 * $x + 6;
echo "X = $x. <br> Y = $y ";*/

//..4.. Даны два целых числа, найти среднее арифметическое
/*$a = 4;
$b = 5;
$ar = ($a + $b) / 2;

echo "Average = $ar";*/

//..5..Составить программу обмена значение трех переменных:
//B присвоить C, A присвоить B, C присвоить A
/*$a = rand(1, 50);
$b = rand(1, 50);
$c = rand(1, 50);
echo "a = $a. b = $b. c = $c <br>";

$tmpA = $a;
$tmpB = $b;
$tmpC = $c;

$a = $b;
$b = $c;
$c = $tmpA;

echo "a = $a. b = $b. c = $c <br>";*/

//..6..C некоторого времени прошло 234 дня, сколько полных недель прошло за этот период
/*$days = 234;
$weeks = $days / 7;
echo "Weeks = $weeks. <br>";

$weeks = (int)$weeks;
echo "intWeeks = $weeks. <br>";*/

//..7..Напечатать ряд чисел 20 в виде: 20 20 20 20 20 20 20 20
/*$num = 20;
for ($i = 0; $i < 9; $i++) {
    echo "$num ";
}*/

//..8..Напечатать стобликом все числа от 20 до 35
/*for ($i = 20; $i <= 35; $i++) {
    echo "$i <br>";
}*/

//..9.. Напечатать таблицу умножения на 7
/*$number = 7;
for ($i = 1; $i <= 9; $i++) {
    $res = $i * $number;
    echo "$i х $number = $res <br>";
}*/

//..10..Расчитать значение Y для значение X, равных 4..28
//y = 2t(2)+5 , t = x+2// (2) - это квадрат
/*for($x = 4; $x <= 28; $x++){
    $t = $x + 2;
    $y = 2*($t**2)+5;
    echo "y = $y <br>";
}*/


