<?php
//.............................................Tasks................................
//..1..Получить линейную запись предложения и вывести рез на экран
/*$res = 1 / (1 + (1 / 2 + (1 / (2 + (3 / 5)))));
echo $res;*/

//..2..Получить линейную запись предложения и вывести рез на экран
/*$a = 5;
$b = 9;
$c = 10;

$res = (-$b + sqrt($b ** 2 - 4 * $a * $c)) / (2 * $a);
echo $res;*/

//echo 5 % 2;//остаток при делении
//echo abs(-22); //показывает положительное число
//echo ceil(3.1534534543) . "<br>"; //округление числа к большему
//echo floor(3.1); //округление числа к меньшему
//echo round(3.154645645, 2) ."<br>"; //округление числа к c цифер после запятой
//$x++;//инкримент +1
//$x += 10; //х = х +10;
//$x -= 10; //х = х -10;
//$x *= 10; //х = х *10;
//$x /= 10; //х = х /10;
//
//
//echo mt_rand(1, 15). "<br>";//рандомной число включительно
//echo min(1, 2, 3) ;// минимальное из чисел
//...............................................СТРОКОВЫЕ ОПЕПАЦИИ.............................

/*$str = 'Hello world';
echo "VAR : $str";

$length = strlen($str);
echo trim('   some  ');//вывод без пробелов в начале и конце слова
$upper = strtoupper(' some');//слово верхний регистр
$lower = strtolower('soMe');//слово в нижний регистр
echo strtoupper(trim( ' some   '));//обьединение ф-ций
echo md5('qwerty');//Хеширование текста*/

//...............................................УСЛОВНЫЕ ОПЕРАТОРЫ.......................................

/*$a = 5;
if($a == 5){//условия ==, !=, >, <, <=, >=
    echo "YES";
}

$str = 'Hello';
if($str == 'Hello'){//условия ==, != для STRING
    echo "YES";
} else {
    echo 'NO';
}

$a = 4;
$str1 = 'HEllo';

if($str1 = 'Hello'){
    echo 'yes';
}elseif ($a == 4){//использование ifelse
    echo 'yes';
}else{
    echo 'no';
}

$a = 5;
$str2 = 'hello';
$isWeatherGood = false;

if(str2 != 'HEllo' || !$isWeatherGood){//!isWeatherGood == isWeatherGood = false// || - ИЛИ, && - И
    echo "FIRST";
}elseif($a == 5){
    $res = 'SECOND';
    echo $res;
}else{
    echo 'no';
}*/
//.....................................ОПЕРАТОР....SWITCH CASE............................................
/*
$x = 6;

switch ($x){
    case 5:
        echo "Var: 5";
        break;
    case 6:
        echo "Var: 6";
        break;
    case 7:
        echo "Var: 7";
        break;
    default:
        echo 'NO RESULT';
        break;
}*/
//.............................................МАССИВЫ..............................................

//$nums = array(12,3,4,5,5,6,4);//массив
//$num1 = [12,3,4,5,5,6,4];//одинаковый массив по разному обьявлен
//$nums[1] = 10;//в скобках указываем индекс и переопределяем
//echo $num[1];
//
//$mix = [12, false, "open", 0.345];//один массив может вмещать в себя все типы данных
//$mix[1] = "false";
//echo $mix[1];
//
//$list = ["age"=> 24, "name" =>"MICH", "hobby" => "music"];//асоциативные массив
//$list2 = [2.5 => 24, true =>"MICH", "hobby" => "music"];//определителем может быть любого типа
//$list["name"] = "MIKHAIL";
//echo $list["name"];
////Многомерные массивы
//$matrix = [
//    [1,2,3,4.45],
//    [1,3,true],
//    [2,4,5,6,"6"]
//];
//
//echo $matrix[1][2] = false;
//echo $matrix[1][2];
//..................................ЦИКЛЫ.................................................

//ЦИКЛ FOR

//for($i = 0; $i< 10;$i++){//в цикле for все условия прописываются в скобках
//    echo $i. '<br>';
//}

//ЦИКЛ WHILE

//$i = 0;//Перед циклом создаем переменную
//while($i < 10){//в скобках указываем только условие
//    echo $i. '<br>';
//    $i++;
//}

//ЦИКЛ  DO WHILE
/*
$i = 0; //обьявляем перед циклом
do{//цикл делает как минимум одно действие
    echo $i;
}while($i<0);//после действия проверяет условие,если подходит продолжает цикл*/

//ОПЕРАТОРЫ В ЦИКЛАХ

/*for($el = 100; $el > 10; $el /=2){
    if($el < 15){
        break;//останавливает цикл при допущении условия
    }
    if($el % 2 == 0){
        continue;//оператор не выходит из цикла и пропускает следующее действие и опять прокручивает цикл
    }
    echo $el. '<br>';
}*/

//МАССИВЫ И ЦИКЛЫ

//$list = [5,6,7,8,false,4.5, 'element'];
//
//for ($i=0; $i<count($list); $i++){//count() считает колво элементов массива
//    echo "Element $i: $list[$i]". '<br>';
//
//}

//$list = ["age" => 24, "name" => "Mich", "hobby" => "Volleyball"];
//
//foreach ($list as $item => $value){
//    echo "Key : $item. Value: $value. <br>";
//}

/*$arr = [1,2,3,4,4,5,6];

foreach ($arr as $item) {//вывод значений
    echo "value: $item". '<br>';
}*/

/*$arr = [1,2,3,4,4,5,6];

foreach ($arr as $i => $item) {//вывод значений c индексами
    echo "Index:$i value: $item". '<br>';
}*/
//..........................................Ф-ЦИИ, ОБЛАСТЬ ВИДИМОСТИ............................

//function info($word){//обьявление ф-ции
//    echo "$word. <br>";
//}
//info(4);//вызов ф-ции

//function math($x, $y){
//    $res = $x + $y;
//    info($res);
//}
//math(4,5);
//............
//function math($x, $y){
//    return $x + $y;
//    /*$res = $x + $y;
//    return $res;//возвращаем результат*/
//}
//$res = math(4,5);

//function summary($arr) {//сумма всех эл массива
//    $summa = 0;
//    foreach ($arr as $value){
//        $summa += $value;
//    }return $summa;
//
//}
//$list = [1,2,3,4,5,6];
//echo summary($list). '<br>';
//echo summary([1,2,3,4,5,6]);
//.......Область видимости.........
/*function info(){
    global $x;//кл слово для области видимости, иначе в ф-ции ее не видно
    $x = 0;
}
$x = 10;
info();
echo $x;*/

/*function click(){
    static $count;//статическая переменная,сохраняет значение после каждого вызова ф-ций
    $count++;
    echo $count;
}

click();
click();
click();*/

//..3.. Вычисления значения ф-ции y=7x(2)-3x+6 при любом значении X( (2) - квадрат
/*$x = rand(1, 100);

$y = 7 * ($x ** 2) - 3 * $x + 6;
echo "X = $x. <br> Y = $y ";*/

//..4.. Даны два целых числа, найти среднее арифметическое
/*$a = 4;
$b = 5;
$ar = ($a + $b) / 2;

echo "Average = $ar";*/

//..5..Составить программу обмена значение трех переменных:
//B присвоить C, A присвоить B, C присвоить A
/*$a = rand(1, 50);
$b = rand(1, 50);
$c = rand(1, 50);
echo "a = $a. b = $b. c = $c <br>";

$tmpA = $a;
$tmpB = $b;
$tmpC = $c;

$a = $b;
$b = $c;
$c = $tmpA;

echo "a = $a. b = $b. c = $c <br>";*/

//..6..C некоторого времени прошло 234 дня, сколько полных недель прошло за этот период
/*$days = 234;
$weeks = $days / 7;
echo "Weeks = $weeks. <br>";

$weeks = (int)$weeks;
echo "intWeeks = $weeks. <br>";*/

//..7..Напечатать ряд чисел 20 в виде: 20 20 20 20 20 20 20 20
/*$num = 20;
for ($i = 0; $i < 9; $i++) {
    echo "$num ";
}*/

//..8..Напечатать стобликом все числа от 20 до 35
/*for ($i = 20; $i <= 35; $i++) {
    echo "$i <br>";
}*/

//..9.. Напечатать таблицу умножения на 7
/*$number = 7;
for ($i = 1; $i <= 9; $i++) {
    $res = $i * $number;
    echo "$i х $number = $res <br>";
}*/

//..10..Расчитать значение Y для значение X, равных 4..28
//y = 2t(2)+5 , t = x+2// (2) - это квадрат
/*for($x = 4; $x <= 28; $x++){
    $t = $x + 2;
    $y = 2*($t**2)+5;
    echo "y = $y <br>";
}*/


