<?php
//......................................ПЕРЕМЕННЫЕ.............................

//$num1 = 5;//обьяв переменной
//$num2 = 7;
//$x = 10;
//
//$bool = $num1 > $num2;// true or false
//echo $bool;
//define("AGE", 25);// константа
//..........................................МАТЕМАТИЧЕСКИЕ ДЕЙСТВИЯ...............................

//echo 5 % 2;//остаток при делении
//echo abs(-22); //показывает положительное число
//echo ceil(3.1534534543) . "<br>"; //округление числа к большему
//echo floor(3.1); //округление числа к меньшему
//echo round(3.154645645, 2) ."<br>"; //округление числа к c цифер после запятой
//$x++;//инкримент +1
//$x += 10; //х = х +10;
//$x -= 10; //х = х -10;
//$x *= 10; //х = х *10;
//$x /= 10; //х = х /10;
//
//
//echo mt_rand(1, 15). "<br>";//рандомной число включительно
//echo min(1, 2, 3) ;// минимальное из чисел
//...............................................СТРОКОВЫЕ ОПЕПАЦИИ.............................

/*$str = 'Hello world';
echo "VAR : $str";

$length = strlen($str);
echo trim('   some  ');//вывод без пробелов в начале и конце слова
$upper = strtoupper(' some');//слово верхний регистр
$lower = strtolower('soMe');//слово в нижний регистр
echo strtoupper(trim( ' some   '));//обьединение ф-ций
echo md5('qwerty');//Хеширование текста*/

//...............................................УСЛОВНЫЕ ОПЕРАТОРЫ.......................................

/*$a = 5;
if($a == 5){//условия ==, !=, >, <, <=, >=
    echo "YES";
}

$str = 'Hello';
if($str == 'Hello'){//условия ==, != для STRING
    echo "YES";
} else {
    echo 'NO';
}

$a = 4;
$str1 = 'HEllo';

if($str1 = 'Hello'){
    echo 'yes';
}elseif ($a == 4){//использование ifelse
    echo 'yes';
}else{
    echo 'no';
}

$a = 5;
$str2 = 'hello';
$isWeatherGood = false;

if(str2 != 'HEllo' || !$isWeatherGood){//!isWeatherGood == isWeatherGood = false// || - ИЛИ, && - И
    echo "FIRST";
}elseif($a == 5){
    $res = 'SECOND';
    echo $res;
}else{
    echo 'no';
}*/
//.....................................ОПЕРАТОР....SWITCH CASE............................................
/*
$x = 6;

switch ($x){
    case 5:
        echo "Var: 5";
        break;
    case 6:
        echo "Var: 6";
        break;
    case 7:
        echo "Var: 7";
        break;
    default:
        echo 'NO RESULT';
        break;
}*/
//.............................................МАССИВЫ..............................................

//$nums = array(12,3,4,5,5,6,4);//массив
//$num1 = [12,3,4,5,5,6,4];//одинаковый массив по разному обьявлен
//$nums [1] = 10;//в скобках указываем индекс и переопределяем
//echo $num[1];
//
//$mix = [12, false, "open", 0.345];//один массив может вмещать в себя все типы данных
//$mix[1] = "false";
//echo $mix[1];
//
//$list = ["age"=> 24, "name" =>"MICH", "hobby" => "music"];//асоциативные массив
//$list2 = [2.5 => 24, true =>"MICH", "hobby" => "music"];//определителем может быть любого типа
//$list["name"] = "MIKHAIL";
//echo $list["name"];
////Многомерные массивы
//$matrix = [
//    [1,2,3,4.45],
//    [1,3,true],
//    [2,4,5,6,"6"]
//];
//
//echo $matrix [1][2] = false;
//echo $matrix [1][2];
//..................................