<?php
//......................................ПЕРЕМЕННЫЕ.............................

//$num1 = 5;//обьяв переменной
//$num2 = 7;
//$x = 10;
//
//$bool = $num1 > $num2;// true or false
//echo $bool;
//define("AGE", 25);// константа
//..........................................МАТЕМАТИЧЕСКИЕ ДЕЙСТВИЯ...............................

//echo 5 % 2;//остаток при делении
//echo abs(-22); //показывает положительное число
//echo ceil(3.1534534543) . "<br>"; //округление числа к большему
//echo floor(3.1); //округление числа к меньшему
//echo round(3.154645645, 2) ."<br>"; //округление числа к c цифер после запятой
//$x++;//инкримент +1
//$x += 10; //х = х +10;
//$x -= 10; //х = х -10;
//$x *= 10; //х = х *10;
//$x /= 10; //х = х /10;
//
//
//echo mt_rand(1, 15). "<br>";//рандомной число включительно
//echo min(1, 2, 3) ;// минимальное из чисел